#language:ru

Функционал: Поиск в Маркете

  Сценарий: Поиск наушников

    Когда Выбран - Маркет
    Тогда Выбран раздел - Электроника
    И Выбран раздел - Наушники

    Когда Выбраны настройки фильтра
    Тогда Выполнено нажатие на кнопку - Применить

    Когда Выполнена проверка количества элементов на странице - "Показывать по 12"
    Тогда Найден первый элемент из списка

    Когда Выполнен поиск по первому элементу
    Тогда Выполнена проверка соответствия полученного товара и искомого


